IDENTIFICATION DIVISION.
PROGRAM-ID. CRAPS-DISPLAY.

DATA DIVISION.
LINKAGE SECTION.
01 LK-PASS-BET          PIC Z(5).
01 LK-DONT-PASS-BET     PIC Z(5).
01 LK-COME-BET          PIC Z(5).
01 LK-DONT-COME-BET     PIC Z(5).

SCREEN SECTION.
01 CRAPS-FORM BACKGROUND-COLOR 2 FOREGROUND-COLOR 7  HIGHLIGHT.
    02 BLANK SCREEN.
    02 LINE 1 COL 8 VALUE "CRAPS GAME".
    02 LINE 3 COL 4 VALUE "PASS BET: ".
    02 LINE 3 COL 20 USING LK-PASS-BET.

    02 LINE 4 COL 4 VALUE "DON'T PASS BET: ".
    02 LINE 4 COL 20 USING LK-DONT-PASS-BET.

    02 LINE 5 COL 4 VALUE "COME BET: ".
    02 LINE 5 COL 20 USING LK-COME-BET.
    
    02 LINE 6 COL 4 VALUE "DON'T COME BET: ".
    02 LINE 6 COL 20 USING LK-DONT-COME-BET.

    02 LINE 8 COL 4 VALUE "1. BET PASS".
    02 LINE 9 COL 4 VALUE "2. BET DON'T PASS".
    02 LINE 10 COL 4 VALUE "3. ROLL THE DICE".

    02 LINE 11 COL 4 VALUE "Your input: ".


PROCEDURE DIVISION USING LK-PASS-BET LK-DONT-PASS-BET LK-COME-BET LK-DONT-COME-BET.
    DISPLAY CRAPS-FORM.
    ACCEPT CRAPS-FORM.
    STOP RUN.
