IDENTIFICATION DIVISION.
PROGRAM-ID. CRAPS-DISPLAY.

DATA DIVISION.
LINKAGE SECTION.
01 LK-PASS-BET          PIC 9(5).
01 LK-DONT-PASS-BET     PIC 9(5).
01 LK-COME-BET          PIC 9(5).
01 LK-DONT-COME-BET     PIC 9(5).

SCREEN SECTION.
01 CRAPS-FORM BACKGROUND-COLOR 2 FOREGROUND-COLOR 7  HIGHLIGHT.
    02 BLANK SCREEN.
    02 LINE 1 COL 8 VALUE "CRAPS GAME".
    02 LINE 3 COL 4 VALUE "PASS BET: ".
    02 LINE 4 COL 4 VALUE "DON'T PASS BET: ".
    02 LINE 5 COL 4 VALUE "COME BET: ".
    02 LINE 6 COL 4 VALUE "DON'T COME BET: ".

PROCEDURE DIVISION.
    DISPLAY CRAPS-FORM.
    STOP RUN.
