IDENTIFICATION DIVISION.
PROGRAM-ID. CRAPS-DISPLAY.

DATA DIVISION.

WORKING-STORAGE SECTION.
01 WS-PLAYER-INPUT      PIC X(1) VALUE SPACES.
01 WS-MESSAGE           PIC X(1) VALUE 'N'.
01 WS-DieTotal          PIC 9(2).
*>Pass-line pointers
01 WS-PASSPOINTER       PIC 9(2).
01 WS-DONTPASSPOINTER   PIC 9(2).
*>Come-line pointers
01 WS-COMEPOINTER       PIC 9(2).
01 WS-DONTCOMEPOINTER   PIC 9(2).
01 WS-TEMP              PIC Z(5).
01 WS-GAMESTATE         PIC 9(1) VALUE 0.
01 WS-MONEY             PIC 9(5) VALUE 500. 
01 WS-COUNTER           PIC 9(2) VALUE 0.

01 WS-VARIABLE          PIC Z(1).
01 WS-BETWEEN           PIC 9(5).

01 WS-COL-COUNTER       PIC 9(2) VALUE 20.

LINKAGE SECTION.
01 LK-PASS-BET          PIC 9(5).
01 LK-DONT-PASS-BET     PIC 9(5).
01 LK-COME-BET          PIC 9(5).
01 LK-DONT-COME-BET     PIC 9(5).

SCREEN SECTION.
01 CRAPS-LOGO BACKGROUND-COLOR 2 FOREGROUND-COLOR 7  HIGHLIGHT.
    02 BLANK SCREEN.
    02 LINE 1 COL 8 VALUE "  /$$$$$$  /$$$$$$$   /$$$$$$  /$$$$$$$   /$$$$$$".
    02 LINE 2 COL 8 VALUE " /$$__  $$| $$__  $$ /$$__  $$| $$__  $$ /$$__  $$".
    02 LINE 3 COL 8 VALUE "| $$  \__/| $$  \ $$| $$  \ $$| $$  \ $$| $$  \__/".
    02 LINE 4 COL 8 VALUE "| $$      | $$$$$$$/| $$$$$$$$| $$$$$$$/|  $$$$$$ ".
    02 LINE 5 COL 8 VALUE "| $$      | $$__  $$| $$__  $$| $$____/  \____  $$".
    02 LINE 6 COL 8 VALUE "| $$    $$| $$  \ $$| $$  | $$| $$       /$$  \ $$".
    02 LINE 7 COL 8 VALUE "|  $$$$$$/| $$  | $$| $$  | $$| $$      |  $$$$$$/".
    02 LINE 8 COL 8 VALUE " \______/ |__/  |__/|__/  |__/|__/       \______/".


01 CRAPS-BOARD BACKGROUND-COLOR 2 FOREGROUND-COLOR 7 HIGHLIGHT.
    02 LINE 10 COL 4 VALUE "	___________________________________".
    02 LINE 11 COL 4 VALUE "   /  | Don't |   |   |   |   |   |   |".
    02 LINE 12 COL 4 VALUE "  /|  | Come: | 4 | 5 | 6 | 8 | 9 | 10|".
    02 LINE 13 COL 4 VALUE " / |  | ##### |-----------------|-----|".
    02 LINE 13 COL 12 USING LK-DONT-COME-BET.
    02 LINE 14 COL 4 VALUE "/  |  |_______|_________________|".
    02 LINE 15 COL 4 VALUE "|  |  \ COME: #####             |".
    02 LINE 15 COL 18 USING LK-COME-BET.
    02 LINE 16 COL 4 VALUE "|  |___\________________________|".
    02 LINE 17 COL 4 VALUE "|  |   |Don't Pass Bar: #####   |".
    02 LINE 17 COL 28 USING LK-DONT-PASS-BET.
    02 LINE 18 COL 4 VALUE "|  \___|________________________|".
    02 LINE 19 COL 4 VALUE "|       Pass Line: #####        |".
    02 LINE 19 COL 23 USING LK-PASS-BET.
    02 LINE 20 COL 4 VALUE "\_______________________________| BALANCE: ".
    02 LINE 20 COL 47 USING WS-MONEY.




01 COMEOUT-MENU BACKGROUND-COLOR 2 FOREGROUND-COLOR 7 HIGHLIGHT. 
    02 LINE 22 COL 4 VALUE "1. BET PASS".
    02 LINE 23 COL 4 VALUE "2. BET DON'T PASS".
    02 LINE 24 COL 4 VALUE "Press ENTER to Roll the dice".

01 POINT-MENU BACKGROUND-COLOR 2 FOREGROUND-COLOR 7 HIGHLIGHT. 
    02 LINE 22 COL 4 VALUE "1. BET COME".
    02 LINE 23 COL 4 VALUE "2. BET DON'T COME".
    02 LINE 24 COL 4 VALUE "Press ENTER to Roll the dice".


01 USER-INPUT BACKGROUND-COLOR 2 FOREGROUND-COLOR 7 HIGHLIGHT.
    02 LINE 25 COL 4 VALUE "Your input: ".
    02 LINE 25 COL 16 USING WS-PLAYER-INPUT.

01 BET-INPUT BACKGROUND-COLOR 2 FOREGROUND-COLOR 7 HIGHLIGHT.
    02 LINE 21 COL 4 VALUE "How much would you like to bet: ".
    02 LINE 21 COL 36 USING WS-TEMP.

01 ROLL-MENU BACKGROUND-COLOR 2 FOREGROUND-COLOR 7 HIGHLIGHT.
    02 LINE 21 COL 4 VALUE " Roll".

01 TEMP-MENU BACKGROUND-COLOR 2 FOREGROUND-COLOR 7 HIGHLIGHT.
    02 LINE 22 COL 4 USING WS-PLAYER-INPUT.

01 FAIL-STATE BACKGROUND-COLOR 2 FOREGROUND-COLOR 7 HIGHLIGHT.
    02 LINE 22 COL 4 VALUE "Max bet for this table is 200.".
    02 LINE 23 COL 4 VALUE "You either bet too much,".
    02 LINE 24 COL 4 VALUE "or you don't have enough money".
    02 LINE 25 COL 4 VALUE "Press ENTER to continue.".     

01 POINT-DISPLAY BACKGROUND-COLOR 2 FOREGROUND-COLOR 7 HIGHLIGHT.
    02 LINE 11 COL WS-COL-COUNTER VALUE "ON".

01 OFF-DISPLAY BACKGROUND-COLOR 2 FOREGROUND-COLOR 7 HIGHLIGHT.
    02 LINE 15 COL 30 VALUE "OFF".

01 TEST-DISPLAY BACKGROUND-COLOR 2 FOREGROUND-COLOR 7 HIGHLIGHT.
    02 LINE 27 COL 4 USING WS-GAMESTATE.
    02 LINE 28 COL 4 USING WS-DieTotal.
    02 LINE 29 COL 4 USING WS-PASSPOINTER.
    02 LINE 30 COL 4 USING WS-DONTPASSPOINTER.
    02 LINE 31 COL 4 USING WS-COMEPOINTER.
    02 LINE 32 COL 4 USING WS-DONTCOMEPOINTER.
    02 LINE 32 COL 4 USING WS-COUNTER.

01 BLANK-DISPLAY BACKGROUND-COLOR 2 FOREGROUND-COLOR 7 HIGHLIGHT.
    02 BLANK SCREEN.

01 LOSS-SCREEN BACKGROUND-COLOR 2 FOREGROUND-COLOR 7 HIGHLIGHT.
    02 LINE 2 COL 4 VALUE "You ran out of money, would you like to continue?".
    02 LINE 3 COL 4 VALUE "Press ENTER to continue or Press Q to quit!".
    02 LINE 4 COL 4 USING WS-PLAYER-INPUT.

01 WIN-SCREEN BACKGROUND-COLOR 2 FOREGROUND-COLOR 7 HIGHLIGHT.
    02 LINE 2 COL 4 VALUE "You made it through 10 rounds of craps!".
    02 LINE 3 COL 4 VALUE "Press ENTER to submit your score.".
    02 LINE 4 COL 4 VALUE "or Press Q to quit without submitting your name!".
    02 LINE 5 COL 4 USING WS-PLAYER-INPUT.

PROCEDURE DIVISION USING LK-PASS-BET LK-DONT-PASS-BET LK-COME-BET LK-DONT-COME-BET.

DISPLAY-MAIN-SCREEN.

    DISPLAY CRAPS-LOGO.
    DISPLAY CRAPS-BOARD.
    CALL "DICE-DISPLAY" USING WS-DieTotal.
    DISPLAY TEST-DISPLAY.





    IF WS-MESSAGE = 'N'
        IF WS-GAMESTATE = 0
            DISPLAY COMEOUT-MENU
            DISPLAY OFF-DISPLAY
        END-IF
        IF WS-GAMESTATE = 1
            IF WS-PASSPOINTER = 4 OR WS-DONTPASSPOINTER = 4 OR WS-COMEPOINTER = 4 OR WS-DONTCOMEPOINTER = 4
                MOVE 20 TO WS-COL-COUNTER
            END-IF

            IF WS-PASSPOINTER = 5 OR WS-DONTPASSPOINTER = 5 OR WS-COMEPOINTER = 5 OR WS-DONTCOMEPOINTER = 5
                MOVE 24 TO WS-COL-COUNTER
            END-IF

            IF WS-PASSPOINTER = 6 OR WS-DONTPASSPOINTER = 6 OR WS-COMEPOINTER = 6 OR WS-DONTCOMEPOINTER = 6
                MOVE 28 TO WS-COL-COUNTER
            END-IF

            IF WS-PASSPOINTER = 8 OR WS-DONTPASSPOINTER = 8 OR WS-COMEPOINTER = 8 OR WS-DONTCOMEPOINTER = 7
                MOVE 32 TO WS-COL-COUNTER
            END-IF

            IF WS-PASSPOINTER = 9 OR WS-DONTPASSPOINTER = 9 OR WS-COMEPOINTER = 9 OR WS-DONTCOMEPOINTER = 8
                MOVE 36 TO WS-COL-COUNTER
            END-IF

            IF WS-PASSPOINTER = 10 OR WS-DONTPASSPOINTER = 10 OR WS-COMEPOINTER = 10 OR WS-DONTCOMEPOINTER = 10
                MOVE 40 TO WS-COL-COUNTER
            END-IF

            DISPLAY POINT-MENU
            DISPLAY POINT-DISPLAY
    END-IF.

    DISPLAY USER-INPUT.
    ACCEPT USER-INPUT.
    DISPLAY TEMP-MENU


    EVALUATE WS-PLAYER-INPUT
        WHEN 1
            MOVE 'X' TO WS-MESSAGE
        WHEN 2
            MOVE 'Y' TO WS-MESSAGE
        WHEN SPACES
            MOVE 'Z' TO WS-MESSAGE
        WHEN OTHER
            DISPLAY "Invalid option. Try again."
    END-EVALUATE.


    IF WS-MESSAGE = 'X'
        DISPLAY CRAPS-LOGO
        DISPLAY CRAPS-BOARD
        DISPLAY BET-INPUT

        IF WS-GAMESTATE = 0
            ACCEPT WS-BETWEEN
            ADD WS-BETWEEN TO LK-PASS-BET GIVING LK-PASS-BET
            IF LK-PASS-BET > 200 OR LK-PASS-BET > WS-MONEY
                DISPLAY FAIL-STATE
                SUBTRACT WS-BETWEEN FROM LK-PASS-BET GIVING LK-PASS-BET
                MOVE 0 TO WS-BETWEEN
                MOVE 'N' TO WS-MESSAGE
                MOVE ' ' TO WS-PLAYER-INPUT
                ACCEPT WS-VARIABLE
                GO TO DISPLAY-MAIN-SCREEN
            END-IF
            
            SUBTRACT LK-PASS-BET FROM WS-MONEY GIVING WS-MONEY
            MOVE 'N' TO WS-MESSAGE
        END-IF

        IF WS-GAMESTATE = 1
            ACCEPT WS-BETWEEN
            ADD WS-BETWEEN TO LK-COME-BET GIVING LK-COME-BET
            IF LK-COME-BET > 200 OR  LK-COME-BET > WS-MONEY
                DISPLAY FAIL-STATE
                SUBTRACT WS-BETWEEN FROM LK-COME-BET GIVING LK-COME-BET
                MOVE 0 TO WS-BETWEEN
                MOVE 'N' TO WS-MESSAGE
                MOVE ' ' TO WS-PLAYER-INPUT
                ACCEPT WS-VARIABLE
            END-IF

            SUBTRACT LK-COME-BET FROM WS-MONEY GIVING WS-MONEY
            MOVE 'N' TO WS-MESSAGE
        END-IF
    END-IF


    IF WS-MESSAGE = 'Y'
        DISPLAY CRAPS-LOGO
        DISPLAY CRAPS-BOARD
        DISPLAY BET-INPUT

        IF WS-GAMESTATE = 0
            ACCEPT WS-BETWEEN
            ADD WS-BETWEEN TO LK-DONT-PASS-BET GIVING LK-DONT-PASS-BET
            IF LK-DONT-PASS-BET > 200 OR LK-DONT-PASS-BET > WS-MONEY
                DISPLAY FAIL-STATE
                SUBTRACT WS-BETWEEN FROM LK-DONT-PASS-BET GIVING LK-DONT-PASS-BET
                MOVE 0 TO WS-BETWEEN
                MOVE 'N' TO WS-MESSAGE
                MOVE ' ' TO WS-PLAYER-INPUT
                ACCEPT WS-VARIABLE
            END-IF
            
            SUBTRACT LK-DONT-PASS-BET FROM WS-MONEY GIVING WS-MONEY
            MOVE 'N' TO WS-MESSAGE
        END-IF
    

        IF WS-GAMESTATE = 1
            ACCEPT WS-BETWEEN
            ADD WS-BETWEEN TO LK-DONT-COME-BET GIVING LK-DONT-COME-BET
            IF LK-DONT-COME-BET > 200 OR LK-DONT-COME-BET > WS-MONEY
                DISPLAY FAIL-STATE
                SUBTRACT WS-BETWEEN FROM LK-DONT-COME-BET GIVING LK-DONT-COME-BET
                MOVE 0 TO WS-BETWEEN
                MOVE 'N' TO WS-MESSAGE
                MOVE ' ' TO WS-PLAYER-INPUT
                ACCEPT WS-VARIABLE
            END-IF

            SUBTRACT LK-DONT-COME-BET FROM WS-MONEY GIVING WS-MONEY
            MOVE 'N' TO WS-MESSAGE
        END-IF
    END-IF

    IF WS-MESSAGE = 'Z'
        CALL "GAMEPLAY-TEST" USING
         WS-DieTotal
         WS-GameState
         LK-PASS-BET
         LK-DONT-PASS-BET
         LK-COME-BET
         LK-DONT-COME-BET
         WS-MONEY
         WS-PASSPOINTER
         WS-DONTPASSPOINTER
         WS-COMEPOINTER
         WS-DONTCOMEPOINTER
        MOVE 'N' TO WS-MESSAGE
        ADD 1 TO WS-COUNTER GIVING WS-COUNTER
    END-IF.




    MOVE 'N' TO WS-MESSAGE.
    MOVE ' ' TO WS-PLAYER-INPUT.
    IF WS-COUNTER NOT = 10 AND WS-MONEY NOT = 0
        GO TO DISPLAY-MAIN-SCREEN
    END-IF.

    IF WS-MONEY = 0 AND WS-GAMESTATE = 0
        MOVE ' ' TO WS-PLAYER-INPUT
        DISPLAY BLANK-DISPLAY
        DISPLAY LOSS-SCREEN
        ACCEPT LOSS-SCREEN
        IF WS-PLAYER-INPUT = 'Q'
            STOP RUN
        END-IF

        IF WS-PLAYER-INPUT = SPACES
            MOVE ' ' TO WS-PLAYER-INPUT
            MOVE 'N' TO WS-MESSAGE
            MOVE 0 TO WS-DieTotal
            MOVE 0 TO WS-PASSPOINTER
            MOVE 0 TO WS-DONTPASSPOINTER
            MOVE 0 TO WS-COMEPOINTER
            MOVE 0 TO WS-DONTCOMEPOINTER
            MOVE 0 TO WS-TEMP
            MOVE 0 TO WS-GAMESTATE
            MOVE 500 TO WS-MONEY
            MOVE 0 TO WS-COUNTER
            MOVE 0 TO WS-VARIABLE
            MOVE 0 TO LK-PASS-BET
            MOVE 0 TO LK-DONT-PASS-BET
            MOVE 0 TO LK-COME-BET
            MOVE 0 TO LK-DONT-COME-BET
            MOVE 0 TO WS-BETWEEN
            GO TO DISPLAY-MAIN-SCREEN
        END-IF

    END-IF.

    IF WS-COUNTER = 10 
        MOVE ' ' TO WS-PLAYER-INPUT
        DISPLAY BLANK-DISPLAY
        DISPLAY WIN-SCREEN
        ACCEPT WIN-SCREEN
        
        IF WS-PLAYER-INPUT = 'Q'
            STOP RUN
        END-IF

        IF WS-PLAYER-INPUT = SPACES
            MOVE ' ' TO WS-PLAYER-INPUT
            MOVE 'N' TO WS-MESSAGE
            MOVE 0 TO WS-DieTotal
            MOVE 0 TO WS-PASSPOINTER
            MOVE 0 TO WS-DONTPASSPOINTER
            MOVE 0 TO WS-COMEPOINTER
            MOVE 0 TO WS-DONTCOMEPOINTER
            MOVE 0 TO WS-TEMP
            MOVE 0 TO WS-GAMESTATE
            MOVE 500 TO WS-MONEY
            MOVE 0 TO WS-COUNTER
            MOVE 0 TO WS-VARIABLE
            MOVE 0 TO LK-PASS-BET
            MOVE 0 TO LK-DONT-PASS-BET
            MOVE 0 TO LK-COME-BET
            MOVE 0 TO LK-DONT-COME-BET
            MOVE 0 TO WS-BETWEEN
            GO TO DISPLAY-MAIN-SCREEN
        END-IF

    END-IF.


    STOP RUN.
