IDENTIFICATION DIVISION.
PROGRAM-ID. GAMEPLAY-TEST.

DATA DIVISION.


WORKING-STORAGE SECTION.
01 WS-TEMP		        PIC Z(1).
01 WS-ANOTHERTEMP       PIC 9(1).
01 WS-TEMPTHREE         PIC 9(1).
01 COMETEMP			    PIC 9(1).

LINKAGE SECTION.
01 LK-DieTotal          PIC 9(2).
01 LK-GameState         PIC 9(1).
01 LK-PASS-BET          PIC 9(5).
01 LK-DONT-PASS-BET     PIC 9(5).
01 LK-COME-BET          PIC 9(5).
01 LK-DONT-COME-BET     PIC 9(5).
01 LK-MONEY             PIC 9(5).
01 LK-PASSPOINTER       PIC 9(2).
01 LK-DONTPASSPOINTER   PIC 9(2).
01 LK-COMEPOINTER       PIC 9(2).
01 LK-DONTCOMEPOINTER   PIC 9(2).

PROCEDURE DIVISION USING LK-DieTotal LK-GameState LK-PASS-BET LK-DONT-PASS-BET LK-COME-BET LK-DONT-COME-BET LK-MONEY LK-PASSPOINTER LK-DONTPASSPOINTER LK-COMEPOINTER LK-DONTCOMEPOINTER .

GAMEPLAY-TEST.
	IF LK-GameState = 0 THEN 
        MOVE 0 TO WS-ANOTHERTEMP
		MOVE 0 TO COMETEMP
		MOVE 0 TO LK-COMEPOINTER
		MOVE 0 TO LK-DONTCOMEPOINTER
		MOVE 0 TO LK-DONTPASSPOINTER
		MOVE 0 TO Lk-PASSPOINTER
		 
		CALL "ROLL-TEST" USING LK-DieTotal
        CALL "DICE-DISPLAY" USING LK-DieTotal
		IF LK-DieTotal = 7 OR LK-DieTotal = 11
	      	DISPLAY "Pass bet wins!"
			ACCEPT WS-TEMP
	      	ADD LK-PASS-BET TO LK-MONEY GIVING LK-MONEY
			ADD LK-PASS-BET TO LK-MONEY GIVING LK-MONEY
			MOVE 0 TO LK-PASS-BET
			MOVE 0 TO LK-DONT-PASS-BET
			MOVE 1 TO WS-ANOTHERTEMP
		END-IF

		IF LK-DieTotal = 2 OR LK-DieTotal = 3 OR LK-DieTotal = 12 THEN
	      	DISPLAY "Dont Pass Bet wins!"
			ACCEPT WS-TEMP
	      	ADD LK-DONT-PASS-BET TO LK-MONEY GIVING LK-MONEY
			ADD LK-DONT-PASS-BET TO LK-MONEY GIVING LK-MONEY
			MOVE 0 TO LK-DONT-PASS-BET
			MOVE 0 TO LK-PASS-BET
			MOVE 1 TO WS-ANOTHERTEMP
		END-IF

		IF WS-ANOTHERTEMP NOT = 1 AND LK-PASS-BET NOT = 0 
			MOVE LK-DieTotal TO LK-PASSPOINTER  
			MOVE 1 TO LK-GameState
		END-IF

		IF WS-ANOTHERTEMP NOT = 1 AND LK-DONT-PASS-BET NOT = 0
			MOVE LK-DieTotal TO LK-DONTPASSPOINTER
			MOVE 1 TO LK-GameState
		END-IF
	ELSE
		MOVE 0 TO WS-TEMPTHREE 
		CALL "ROLL-TEST" USING LK-DieTotal
        CALL "DICE-DISPLAY" USING LK-DieTotal
		MOVE 0 TO WS-ANOTHERTEMP
		IF LK-PASSPOINTER = LK-DieTotal AND LK-DONTPASSPOINTER = 0
			ADD LK-PASS-BET TO LK-MONEY GIVING LK-MONEY
			ADD LK-PASS-BET TO LK-MONEY GIVING LK-MONEY
			MOVE 0 TO LK-PASS-BET
			MOVE 0 TO LK-DONT-PASS-BET
		END-IF
		IF LK-PASSPOINTER = 0 AND LK-DieTotal = 7 AND LK-DONTPASSPOINTER NOT = 0
			ADD LK-PASS-BET TO LK-MONEY GIVING LK-MONEY
			ADD LK-PASS-BET TO LK-MONEY GIVING LK-MONEY
			MOVE 0 TO LK-PASS-BET
			MOVE 0 TO LK-DONT-PASS-BET
		END-IF

		IF LK-DONTPASSPOINTER = LK-DieTotal AND LK-PASSPOINTER = 0
			ADD LK-DONT-PASS-BET TO LK-MONEY GIVING LK-MONEY
			ADD LK-DONT-PASS-BET TO LK-MONEY GIVING LK-MONEY
			MOVE 0 TO LK-PASS-BET
			MOVE 0 TO LK-DONT-PASS-BET
		END-IF

		IF LK-DONTPASSPOINTER = 0 AND LK-DieTotal = 7 AND LK-PASSPOINTER NOT = 0
			ADD LK-DONT-PASS-BET TO LK-MONEY GIVING LK-MONEY
			ADD LK-DONT-PASS-BET TO LK-MONEY GIVING LK-MONEY
			MOVE 0 TO LK-PASS-BET
			MOVE 0 TO LK-DONT-PASS-BET
		END-IF
		*> Come pointers
		IF LK-COMEPOINTER = LK-DieTotal AND LK-DONTCOMEPOINTER = 0
			ADD LK-COME-BET TO LK-MONEY GIVING LK-MONEY
			ADD LK-COME-BET TO LK-MONEY GIVING LK-MONEY
			MOVE 0 TO LK-COME-BET
			MOVE 0 TO LK-DONT-COME-BET
			MOVE 0 TO LK-PASS-BET
			MOVE 0 TO LK-DONT-PASS-BET
			MOVE 0 TO LK-COMEPOINTER
            MOVE 0 TO LK-DONTCOMEPOINTER
			MOVE 0 TO LK-GameState
			MOVE 1 TO WS-TEMPTHREE
		END-IF
		IF LK-COMEPOINTER = 0 AND LK-DieTotal = 7 AND LK-DONTCOMEPOINTER NOT = 0
			ADD LK-COME-BET TO LK-MONEY GIVING LK-MONEY
			ADD LK-COME-BET TO LK-MONEY GIVING LK-MONEY
			MOVE 0 TO LK-COME-BET
			MOVE 0 TO LK-PASS-BET
			MOVE 0 TO LK-DONT-PASS-BET
			MOVE 0 TO LK-COMEPOINTER
            MOVE 0 TO LK-DONTCOMEPOINTER
			MOVE 0 TO LK-DONT-COME-BET
			MOVE 0 TO LK-GameState
			MOVE 1 TO WS-TEMPTHREE
		END-IF

		IF LK-DONTCOMEPOINTER = LK-DieTotal AND LK-COMEPOINTER = 0
			ADD LK-DONT-COME-BET TO LK-MONEY GIVING LK-MONEY
			ADD LK-DONT-COME-BET TO LK-MONEY GIVING LK-MONEY
			MOVE 0 TO LK-COME-BET
			MOVE 0 TO LK-DONT-COME-BET
			MOVE 0 TO LK-PASS-BET
			MOVE 0 TO LK-COMEPOINTER
            MOVE 0 TO LK-DONTCOMEPOINTER 
			MOVE 0 TO LK-DONT-PASS-BET
			MOVE 0 TO LK-GameState
			MOVE 1 TO WS-TEMPTHREE
		END-IF

		IF LK-DONTCOMEPOINTER = 0 AND LK-DieTotal = 7 AND LK-COMEPOINTER NOT = 0
			ADD LK-DONT-COME-BET TO LK-MONEY GIVING LK-MONEY
			ADD LK-DONT-COME-BET TO LK-MONEY GIVING LK-MONEY
			MOVE 0 TO LK-COME-BET
            MOVE 0 TO LK-DONTCOMEPOINTER
			MOVE 0 TO LK-PASS-BET
			MOVE 0 TO LK-DONT-PASS-BET
			MOVE 0 TO LK-DONT-COME-BET
			MOVE 0 TO LK-GameState
			MOVE 1 TO WS-TEMPTHREE
		END-IF

		*> Normal game 
		IF COMETEMP = 0 
			IF LK-DieTotal = 7 OR LK-DieTotal = 11
				IF WS-TEMPTHREE = 0 AND COMETEMP = 0 
					DISPLAY "Come bet wins!"
					ACCEPT WS-TEMP
					ADD LK-COME-BET TO LK-MONEY GIVING LK-MONEY
					ADD LK-COME-BET TO LK-MONEY GIVING LK-MONEY
					MOVE 0 TO LK-COME-BET
					MOVE 0 TO LK-DONT-COME-BET
					MOVE 1 TO WS-ANOTHERTEMP
					MOVE 0 TO LK-GameState
					MOVE 0 TO LK-PASS-BET
					MOVE 0 TO LK-DONT-PASS-BET
					MOVE 0 TO LK-PASSPOINTER
					MOVE 0 TO LK-DONTPASSPOINTER
				END-IF
			END-IF

			IF LK-DieTotal = 2 OR LK-DieTotal = 3
				IF WS-TEMPTHREE = 0 AND COMETEMP = 0
					DISPLAY "Dont Come Bet wins!"
					ACCEPT WS-TEMP
					ADD LK-DONT-COME-BET TO LK-MONEY GIVING LK-MONEY
					ADD LK-DONT-COME-BET TO LK-MONEY GIVING LK-MONEY
					MOVE 0 TO LK-DONT-COME-BET
					MOVE 0 TO LK-COME-BET
					MOVE 1 TO WS-ANOTHERTEMP
					MOVE 0 TO LK-GameState
					MOVE 0 TO LK-PASS-BET
					MOVE 0 TO LK-DONT-PASS-BET
					MOVE 0 TO LK-PASSPOINTER
					MOVE 0 TO LK-DONTPASSPOINTER
				END-IF
			END-IF

			IF WS-ANOTHERTEMP NOT = 1 AND LK-PASS-BET NOT = 0 AND LK-COMEPOINTER = 0 AND LK-DONTCOMEPOINTER = 0
				MOVE LK-DieTotal TO LK-COMEPOINTER   
				MOVE 1 TO COMETEMP
			END-IF

			IF WS-ANOTHERTEMP NOT = 1 AND LK-DONT-PASS-BET NOT = 0 AND LK-COMEPOINTER = 0 AND LK-DONTCOMEPOINTER = 0
				MOVE LK-DieTotal TO LK-DONTCOMEPOINTER
				MOVE 1 TO COMETEMP
			END-IF
		END-IF
	END-IF
EXIT.
